# HookOrient0 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendData..::..HookOrient0 Property
RebarBendData Class See Also
---
The orientation of the hook at the start.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public RebarHookOrientation HookOrient0 { get; set; }
```

Visual Basic
---
```text
Public Property HookOrient0 As RebarHookOrientation
	Get
	Set
```

Visual C++
---
```text
public:
property RebarHookOrientation HookOrient0 {
	RebarHookOrientation get ();
	void set (RebarHookOrientation value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace